In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_excel("https://github.com/ansharora23/Bennett-Sem5/blob/master/DeepLearning/Lab2/Data/Online%20Retail.xlsx?raw=true")

In [4]:
subset=df.iloc[ : , : 4]
subset=subset[subset["InvoiceNo"]==536544]
subset

     InvoiceNo StockCode                      Description  Quantity
1443    536544     21773  DECORATIVE ROSE BATHROOM BOTTLE         1
1444    536544     21774  DECORATIVE CATS BATHROOM BOTTLE         2
1445    536544     21786               POLKADOT RAIN HAT          4
1446    536544     21787            RAIN PONCHO RETROSPOT         2
1447    536544     21790               VINTAGE SNAP CARDS         9
...        ...       ...                              ...       ...
1965    536544     21721        CANDY SHOP  STICKER SHEET         1
1966    536544     21722      SWEET PUDDING STICKER SHEET         1
1967    536544     21731    RED TOADSTOOL LED NIGHT LIGHT         5
1968    536544     21742      LARGE ROUND WICKER PLATTER          1
1969    536544     21758             VINTAGE SHELLS PRINT         1

[527 rows x 4 columns]

In [5]:
data=df.filter(items=['StockCode', 'UnitPrice'])

In [6]:
print("Minimum")
print(data.UnitPrice.min())

Minimum
-11062.06

In [7]:
print("Maximum")
print(data.UnitPrice.max())

Maximum
38970.0

In [8]:
print("Median")
print(data.UnitPrice.median())

Median
2.08

In [9]:
print("Mean")
print(data.UnitPrice.mean())

Mean
4.611113626083471

In [10]:
print("Count")
print(data.UnitPrice.count())

Count
541909

In [11]:
print("Sum")
print(data.UnitPrice.sum())

Sum
2498803.974

In [12]:
print("Standard Deviation")
print(data.UnitPrice.std())

Standard Deviation
96.75985306119716

In [13]:
print("Variance")
print(data.UnitPrice.var())

Variance
9362.469164424467

In [14]:
new_df=df[100:]
new_df.reset_index(inplace=True)

In [15]:
new_df=new_df.sort_values(["InvoiceDate"])

In [21]:
new_df = new_df.dropna()

In [22]:
Description=pd.Series(new_df["Description"])

In [23]:
Description=Description.str.startswith('D')

In [24]:
print("Description that starts with letter D")
new_df[Description.values]

Description that starts with letter D

         index InvoiceNo StockCode  ... UnitPrice  CustomerID         Country
40         140    536381     21523  ...      6.75     15311.0  United Kingdom
41         141   C536379         D  ...     27.50     14527.0  United Kingdom
85         185    536388     21523  ...      7.95     16250.0  United Kingdom
128        228    536390     22654  ...      4.95     17511.0  United Kingdom
119        219    536390     20668  ...      0.10     17511.0  United Kingdom
...        ...       ...       ...  ...       ...         ...             ...
541553  541653    581538     23033  ...      1.45     14446.0  United Kingdom
541551  541651    581538     23034  ...      1.45     14446.0  United Kingdom
541627  541727    581570     23077  ...      1.25     12662.0         Germany
541633  541733    581571     48187  ...      8.25     15311.0  United Kingdom
541793  541893    581586     20685  ...      7.08     13113.0  United Kingdom

[14535 rows x 9 columns]

# Creating dataframe

In [28]:
#list of lists
data = [["Rohan", "23-05-2000", 87], ["Sunny", "10-12-1999", 77],["Nina", "13-09-2000", 98], ["Ashit", "17-11-1999", 75], ["Sandra", "20-02-1999", 88]]
df1 = pd.DataFrame(data, columns = ['Student Name', 'DOB', 'Marks in english'])
df1

  Student Name         DOB  Marks in english
0        Rohan  23-05-2000                87
1        Sunny  10-12-1999                77
2         Nina  13-09-2000                98
3        Ashit  17-11-1999                75
4       Sandra  20-02-1999                88

In [31]:
data = {'Student Name':['Rohan', 'Sunny', 'Nina','Ashit','Sandra'],  'Date of Birth':['10-11-2000','24-02-2000','22-09-2000' ,'05-01-1999', '24-02-2000'],  'Marks in maths':[100,88,72,72,80]} 
df2 = pd.DataFrame(data)
df2

  Student Name Date of Birth  Marks in maths
0        Rohan    10-11-2000             100
1        Sunny    24-02-2000              88
2         Nina    22-09-2000              72
3        Ashit    05-01-1999              72
4       Sandra    24-02-2000              80

In [32]:
data = [{'Student Name': 'Rohan', 'Date of Birth': '02-01-2001', 'Marks in maths':21},
        {'Student Name': 'Sunny', 'Date of Birth': '25-12-2000', 'Marks in maths':44},
        {'Student Name': 'Nina', 'Date of Birth': '13-12-1999', 'Marks in maths':41},
        {'Student Name': 'Ashit', 'Date of Birth': '11-11-1999', 'Marks in maths':54},
        {'Student Name': 'Sandra', 'Date of Birth': '01-10-1999', 'Marks in maths':100}] 
df3 = pd.DataFrame(data)
df3

  Student Name Date of Birth  Marks in maths
0        Rohan    02-01-2001              21
1        Sunny    25-12-2000              44
2         Nina    13-12-1999              41
3        Ashit    11-11-1999              54
4       Sandra    01-10-1999             100

In [34]:
d = {'Student Name' : pd.Series(['Rohan', 'Sunny', 'Jack','Nina','Ashit']), 
      'Date of Birth' : pd.Series(['11-02-2000', '24-05-2000', '11-05-1998','01-05-2000','05-09-2000']),
     'Marks in maths' : pd.Series([100, 95, 91,16,91 ])} 
df4 = pd.DataFrame(d)
df4

  Student Name Date of Birth  Marks in maths
0        Rohan    11-02-2000             100
1        Sunny    24-05-2000              95
2         Jack    11-05-1998              91
3         Nina    01-05-2000              16
4        Ashit    05-09-2000              91

In [37]:
df5 = pd.DataFrame(columns = ['Student Name', 'DOB',"Marks in english"])
df5 = df5.append({'Student Name': 'Rohun', 'DOB': '11-11-2000', 'Marks in english': 99}, ignore_index=True)
df5 = df5.append({'Student Name': 'Sunny', 'DOB': '20-11-2000', 'Marks in english': 91}, ignore_index=True)
df5 = df5.append({'Student Name': 'Nina', 'DOB': '21-11-1998', 'Marks in english': 99}, ignore_index=True)
df5 = df5.append({'Student Name': 'Jamal', 'DOB': '23-10-1997', 'Marks in english': 94}, ignore_index=True)
df5 = df5.append({'Student Name': 'Jima', 'DOB': '31-01-1991', 'Marks in english': 94}, ignore_index=True)
df5

  Student Name         DOB Marks in english
0        Rohun  11-11-2000               99
1        Sunny  20-11-2000               91
2         Nina  21-11-1998               99
3        Jamal  23-10-1997               94
4         Jima  31-01-1991               94

# Series

In [39]:
s1=pd.Series(np.random.randint(0,100,size=100))
s2=pd.Series(np.random.randint(0,100,size=100))

add=s1+s2
sub=s1-s2
mult=s1*s2
div=s1/s2

data = {'number 1':s1,  'number 2':s2,  'add':add , 'sub':sub ,'mult':mult,'div':div}

df6=pd.DataFrame(data)
df6

    number 1  number 2  add  sub  mult        div
0          2         2    4    0     4   1.000000
1         67        17   84   50  1139   3.941176
2         81        17   98   64  1377   4.764706
3          3        12   15   -9    36   0.250000
4         33        53   86  -20  1749   0.622642
..       ...       ...  ...  ...   ...        ...
95        90        54  144   36  4860   1.666667
96        60        79  139  -19  4740   0.759494
97        74        89  163  -15  6586   0.831461
98        60        49  109   11  2940   1.224490
99        34         2   36   32    68  17.000000

[100 rows x 6 columns]